Revit 2027 API
TableCellStyleOverrideOptions.BorderRightLineStyle Property
 Indicates if the border right line style characteristic is overridden.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool BorderRightLineStyle { get; set; }
Public Property BorderRightLineStyle As Boolean
	Get
	Set
public:
property bool BorderRightLineStyle {
	bool get ();
	void set (bool value);
}
member BorderRightLineStyle : bool with get, set
Property Value
Boolean
See Also
Reference
TableCellStyleOverrideOptions Class
Autodesk.Revit.DB Namespace